Revit 2026 API

# EnergyDataSettingsPercentageGlazing Property

---

Used for the conceptual energy model. The approximate percentage of the building exterior wall surfaces which are covered by windows or other glazing.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double PercentageGlazing { get; set; }
```
```vb
Public Property PercentageGlazing As Double
	Get
	Set
```
```cpp
public:
property double PercentageGlazing {
	double get ();
	void set (double value);
}
```
```fsharp
member PercentageGlazing : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The percentage glazing value is not between 0.00 and 0.95. |

This value is used to automatically model these glazed openings in massing instances for the Conceptual Energy Analytical Model.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace